//подключение библиотеки
#include <iostream> 
using namespace std;
int main() { 
setlocale (LC_ALL, "Rus");
//П43021
//Пупко Денис
/*1. Из двух чисел с разной четностью вывести на экран нечетное число
int a, b;
cin >> a >> b;
if (a % 2 != 0) cout << a << endl;
else if (b % 2 != 0) cout << b << endl;
return 0;
*/
/*2. Пользователь вводит целое число. Надо вывести на экран положительное оно, отрицательное или ноль.
int a, b, c;
cin >> a >> b >> c;
if (a == 0) cout << " 0 = " << a << endl;
if (b == 0) cout << " 0 = " << b << endl;
if (c == 0) cout << " 0 = " << c << endl;
if (a < 0) cout << " отрицательное = " << a << endl;
if (b < 0) cout << " отрицательное = " << b << endl;
if (c < 0) cout << " отрицательное = " << c << endl;
if (a > 0) cout << " положительное = " << a << endl;
if (b > 0) cout << " положительное = " << b << endl;
if (c > 0) cout << " положительное = " << c << endl;
return 0; 
*/
/*3. По номеру года (от 0 до 2021) определить, этот год високосный или нет.
int x;
cin >> x;
if (x % 4 == 0) cout << "високосный" << x << endl;
if (x % 4 != 0) cout << "обычный" << x << endl;
return 0;
*/
/*4. Вводятся два целых числа не равных нулю. Проверить делится ли первое на второе. Вывести на экран сообщение об этом, а также остаток (если он есть) и частное 
int a, b;
cin >> a >> b;
if (a * b != 0) cout << a * b << endl;
*/
}